From example, I am changing users to actually match something and group handler to avoid duplicates:
```
Terraform will perform the following actions:

  # data.slack_usergroup.by_id will be read during apply
  # (config refers to values not yet known)
 <= data "slack_usergroup" "by_id"  {
      + channels     = (known after apply)
      + description  = (known after apply)
      + handle       = (known after apply)
      + id           = (known after apply)
      + usergroup_id = (known after apply)
      + users        = (known after apply)
    }

  # data.slack_usergroup.by_name will be read during apply
  # (config refers to values not yet known)
 <= data "slack_usergroup" "by_name"  {
      + channels    = (known after apply)
      + description = (known after apply)
      + handle      = (known after apply)
      + id          = (known after apply)
      + name        = "TestGroup"
      + users       = (known after apply)
    }

  # slack_usergroup.my_group will be created
  + resource "slack_usergroup" "my_group" {
      + description = "Test user group"
      + handle      = "test5"
      + id          = (known after apply)
      + name        = "TestGroup"
      + users       = [
          + "U024XM6G8HF",
          + "U03B3V08S1J",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + group_by_id   = {
      + channels     = (known after apply)
      + description  = (known after apply)
      + handle       = (known after apply)
      + id           = (known after apply)
      + name         = null
      + usergroup_id = (known after apply)
      + users        = (known after apply)
    }
  + group_by_name = {
      + channels     = (known after apply)
      + description  = (known after apply)
      + handle       = (known after apply)
      + id           = (known after apply)
      + name         = "TestGroup"
      + usergroup_id = null
      + users        = (known after apply)
    }

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

slack_usergroup.my_group: Creating...
╷
│ Error: could not find usergroup TestGroup: could not find usergroup TestGroup
│
│   with slack_usergroup.my_group,
│   on main.tf line 9, in resource "slack_usergroup" "my_group":
│    9: resource "slack_usergroup" "my_group" {
│
```